tap "azure/bicep"
tap "azure/kubelogin"
tap "buildpacks-community/kpack-cli"
tap "buildpacks/tap"
tap "dapr/tap"
tap "derailed/popeye"
tap "felixkratz/formulae"
tap "fluxcd/tap"
tap "gowebly/tap"
tap "hashicorp/tap"
tap "hudochenkov/sshpass"
tap "miguelmartens/cowardly"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "productdevbook/tap"
tap "slp/krunkit"
brew "xz"
brew "tree"
brew "ansible"
brew "argocd"
brew "asciinema"
brew "atuin"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "awscli"
brew "azcopy"
brew "azure-cli"
brew "bash"
brew "bat"
brew "caddy"
brew "calicoctl"
brew "ccache"
brew "checkov"
brew "cilium-cli"
brew "cmake"
brew "conftest"
brew "coreutils"
brew "cosign"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-credential-helper"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gitleaks"
brew "go"
brew "go-task"
brew "golangci-lint"
brew "grex"
brew "grype"
brew "hcloud"
brew "helm"
brew "helmfile"
brew "hugo"
brew "iperf3"
brew "jq"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "kustomize"
brew "libtool"
brew "llvm"
brew "markdown"
brew "minikube"
brew "nasm"
brew "neovim"
brew "ninja"
brew "nmap"
brew "node"
brew "nvm"
brew "oh-my-posh"
brew "opentofu"
brew "pkgconf"
brew "pnpm"
brew "podman"
brew "pre-commit"
brew "prettier"
brew "pulumi"
brew "python@3.11"
brew "python@3.12"
brew "qt"
brew "renovate"
brew "ripgrep"
brew "scw"
brew "shellcheck"
brew "sqlc"
brew "sqlcmd"
brew "starship"
brew "stow"
brew "syft"
brew "tcpdump"
brew "thefuck"
brew "tree-sitter"
brew "trivy"
brew "uv"
brew "vim"
brew "watch"
brew "wget"
brew "yadm"
brew "yamllint"
brew "yarn"
brew "yazi"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "azure/bicep/bicep"
brew "azure/kubelogin/kubelogin"
brew "buildpacks-community/kpack-cli/kp"
brew "buildpacks/tap/pack"
brew "dapr/tap/dapr-cli"
brew "derailed/popeye/popeye"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/packer"
brew "hudochenkov/sshpass/sshpass"
brew "miguelmartens/cowardly/cowardly"
brew "oven-sh/bun/bun"
brew "slp/krunkit/krunkit"
cask "adobe-acrobat-reader"
cask "balenaetcher"
cask "brave-browser@beta"
cask "bruno"
cask "codex"
cask "cursor"
cask "cyberduck"
cask "displaylink"
cask "dotnet-runtime"
cask "drawio"
cask "font-0xproto-nerd-font"
cask "font-lilex-nerd-font"
cask "google-chrome"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
cask "microsoft-teams"
cask "obsidian"
cask "pearcleaner"
cask "podman-desktop"
cask "productdevbook/tap/portkiller"
cask "proton-mail"
cask "proton-pass"
cask "protonvpn"
cask "raindropio"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "stremio"
cask "the-unarchiver"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "yubico-authenticator"
cask "zed"
cask "zed@preview"
vscode "a-h.templ"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "ankitbko.vscode-pull-request-azdo"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "arrrrny.zed-one-theme"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "crystal-lang-tools.crystal-lang"
vscode "docker.docker"
vscode "dreamcatcher45.podmanager"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "eseom.nunjucks-template"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glebbash.opa-highlight-only"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "intility.vscode-backstage"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mintlify.document"
vscode "mitchdenny.ecdc"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "oven.bun-vscode"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
go "github.com/air-verse/air"
go "golang.org/x/tools/gopls"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/a-h/templ/cmd/templ"
cargo "espup"
