tap "azure/bicep"
tap "azure/functions"
tap "azure/kubelogin"
tap "derailed/popeye"
tap "gowebly/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "oven-sh/bun"
tap "siderolabs/tap"
brew "atuin"
brew "azcopy"
brew "xz"
brew "python@3.12"
brew "azure-cli"
brew "bash"
brew "bat"
brew "calicoctl"
brew "checkov"
brew "cilium-cli"
brew "coreutils"
brew "cosign"
brew "direnv"
brew "dive"
brew "docker-credential-helper"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "gitleaks"
brew "go"
brew "go-task"
brew "golangci-lint"
brew "grype"
brew "hcloud"
brew "helm"
brew "hugo"
brew "iperf3"
brew "jq"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "kustomize"
brew "markdown"
brew "minikube"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "node"
brew "oh-my-posh"
brew "opentofu"
brew "packer"
brew "pipenv"
brew "pkgconf"
brew "pnpm"
brew "podman"
brew "podman-compose"
brew "postgresql@14"
brew "prettier"
brew "pyenv"
brew "python@3.11"
brew "renovate"
brew "ripgrep"
brew "sqlcmd"
brew "starship"
brew "stow"
brew "syft"
brew "tcpdump"
brew "terraform"
brew "thefuck"
brew "tree"
brew "trivy"
brew "vim"
brew "watch"
brew "wget"
brew "yadm"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "azure/bicep/bicep"
brew "azure/functions/azure-functions-core-tools@4"
brew "azure/kubelogin/kubelogin"
brew "derailed/popeye/popeye"
brew "gowebly/tap/gowebly"
brew "oven-sh/bun/bun"
brew "siderolabs/tap/talosctl"
cask "alacritty"
cask "appcleaner"
cask "arc"
cask "azure-data-studio"
cask "balenaetcher"
cask "bitwarden"
cask "bruno"
cask "cursor"
cask "cyberduck"
cask "discord"
cask "displaylink"
cask "dotnet"
cask "drawio"
cask "font-0xproto-nerd-font"
cask "google-chrome"
cask "headlamp"
cask "maccy"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
cask "microsoft-teams"
cask "obsidian"
cask "podman-desktop"
cask "powershell"
cask "protonvpn"
cask "raindropio"
cask "raycast"
cask "slack"
cask "spotify"
cask "stremio"
cask "tableplus"
cask "the-unarchiver"
cask "vial"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "wireshark"
cask "zed"
cask "zed@preview"
cask "zen-browser"
vscode "a-h.templ"
vscode "aaron-bond.better-comments"
vscode "adamhartford.vscode-base64"
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christopherhx.azure-pipelines-vscode-ext"
vscode "codezombiech.gitignore"
vscode "crystal-lang-tools.crystal-lang"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "elagil.pre-commit-helper"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "ibm.output-colorizer"
vscode "jbockle.jbockle-format-files"
vscode "jinliming2.vscode-go-template"
vscode "johnpapa.vscode-peacock"
vscode "marp-team.marp-vscode"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-aks-tools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "oven.bun-vscode"
vscode "redhat.vscode-yaml"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "yzhang.markdown-all-in-one"
